---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerOutOfHost
source: html/51527e2f-6e87-9682-3156-154f5e8644c4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerOutOfHost Property

The hanger is out of its host and will be disconnected.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationHangerOutOfHost { get; }
```